fabkury/p3a/def/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_BSP_BOARD_TYPE_FIB=y
CONFIG_BSP_LCD_CONTROLLER_EK79007=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_LCD_COLOR_FORMAT_RGB888=y
# CONFIG_BSP_LCD_COLOR_FORMAT_RGB565 is not set
CONFIG_LCD_PIXEL_FORMAT_RGB888=y
# CONFIG_LCD_PIXEL_FORMAT_RGB565 is not set
CONFIG_P3A_MAX_SPEED_PLAYBACK=n
# Touch gesture configuration defaults
CONFIG_P3A_TOUCH_SWIPE_MIN_HEIGHT_PERCENT=10
CONFIG_P3A_TOUCH_BRIGHTNESS_MAX_DELTA_PERCENT=75